Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, None, None, 1)     0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, None, None, 16)    160       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, None, None, 16)    0         
_________________________________________________________________
dropout_1 (Dropout)          (None, None, None, 16)    0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, None, None, 32)    4640      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, None, None, 32)    0         
_________________________________________________________________
dropout_2 (Dropout)          (None, None, None, 32)    0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, None, None, 64)    18496     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, None, None, 32)    18464     
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, None, None, 128)   16512     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, None, None, 16)    18448     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, None, None, 128)   8320      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, None, None, 1)     1153      
=================================================================
Total params: 86,193
Trainable params: 86,193
Non-trainable params: 0
_________________________________________________________________
